Итоговая проверочная работа.

Описание решения

Программа решает задачу фильтрации массива строк по критерию длины массива.

•	Задаём начальные массив на старте выполнения алгоритма
Сначала объявляется два массива: изначальный и второй такой же длины. 
Потом метод, в котором цикл соразмерный длине массива. Внутри цикла проверка условия ( <=3 ), если да, то  элемент первого массива заносится в count  элемент второго массива. Переменная count  нужна чтобы поочередно закидывать числа из первого массива во второй и, чтобы потом не было пробелов. После присвоения увеличивается переменная count  на 1 и возвращается к циклу for,  в котором i увеличивается на 1. 
И так проверяется до конца.

Схема алгоритма


Код

 string[] array1 = new string[7] {"1234", "23889900033", "000", "hello", "world", "Kazan", "777"};

string[] array2 = new string[array1.Length];

// Создаём метод SecondArrayWithIF, в котором цикл равен длине массивов.

void SecondArrayWithIF(string[] array1, string[] array2)

// внутри цикла проверка условия ( <=3 ),

// если да -> элемент первого массива заносится в count элемент второго массива.

{
    
    int count = 0;

    for (int i = 0; i < array1.Length; i++)
    {
    if(array1[i].Length <= 3)
        {
        array2[count] = array1[i];
        count++;
        }
    }
}

void PrintArray(string[] array)

{

    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($"{ array[i]} ");
    }
    Console.WriteLine();
}

SecondArrayWithIF(array1, array2);

PrintArray( array2 );

Постановка задачи

Данная работа необходима для проверки ваших знаний и навыков по итогу прохождения первого блока обучения на программе разработчик. Мы должны убедиться, что базовое знакомство с it прошло успешно.
Задача: Написать программу, которая из имеющегося массива строк формирует массив из строк. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:

[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]

[“1234”, “1567”, “-2”, “computer science”] → [“-2”]

[“Russia”, “Denmark”, “Kazan”] → []

Алгоритм выполнения:
1.	Создать репозиторий на GitHub.
2.	Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете ее в отдельный метод).
3.	Снабдить репозиторий оформленным текстовым описанием решения (файл README.md).
4.	Написать программу, решающую поставленную задачу.
5.	Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что все залито одним комитом, как минимум этапы 2, 3 и 4 должны быть расположены в разных комитах).